# SetDetailLevel Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
OverrideGraphicSettings..::..SetDetailLevel Method
OverrideGraphicSettings Class See Also
---
Sets the detail level.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public OverrideGraphicSettings SetDetailLevel(
	ViewDetailLevel detailLevel
)
```

Visual Basic
---
```text
Public Function SetDetailLevel ( _
	detailLevel As ViewDetailLevel _
) As OverrideGraphicSettings
```

Visual C++
---
```text
public:
OverrideGraphicSettings^ SetDetailLevel(
	ViewDetailLevel detailLevel
)
```

# ### Parameters
detailLevel
    Type: Autodesk.Revit.DB..::..ViewDetailLevel Value of the detail level. ViewDetailLevel.Undefined means no override is set.
# ### Return Value
Reference to the changed object.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace